"""Это ваша первая задача. Напишите программу, которая считывает два целых числа и выводит их сумму."""


def main():
    print(int(input()) + int(input()))


if __name__ == '__main__':
    main()
