"""
Рита по поручению Тимофея наводит порядок в правильных скобочных последовательностях (ПСП),
состоящих только из круглых скобок (). Для этого ей надо сгенерировать все ПСП длины 2n в
алфавитном порядке —– алфавит состоит из ( и ) и открывающая скобка идёт раньше закрывающей.

Помогите Рите —– напишите программу, которая по заданному n выведет все ПСП в нужном порядке.

Рассмотрим второй пример. Надо вывести ПСП из четырёх символов. Таких всего две:

(())
()()

(()) идёт раньше ()(), так как первый символ у них одинаковый,
а на второй позиции у первой ПСП стоит (, который идёт раньше ).
Формат ввода
На вход функция принимает n — целое число от 0 до 10.
"""

import sys


def generate_braces(n, open_count=0, prefix=''):
    if open_count < n - len(prefix):
        yield from generate_braces(n, open_count + 1, prefix + '(')
    if open_count > 0:
        yield from generate_braces(n, open_count - 1, prefix + ')')
    if n == len(prefix):
        yield prefix


def main():
    n = int(sys.stdin.readline().rstrip())
    print(*generate_braces(n * 2), sep='\n')


if __name__ == '__main__':
    main()
